касса_Вегас/src/InformationRegisters/ЗапросыЕГАИС/ЗапросыЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапросыЕГАИС</name>
  <resources>
    <name>ТипЗапроса</name>
    <type>
      <types>CatalogRef.ВидыОбъектовЕГАИС</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапроса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

касса_Вегас/src/InformationRegisters/ЗапросыЕГАИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Удаляет запрос из регистра сведений.
//
// Параметры:
//  Идентификатор  - Строка - идентификатор удаляемого запроса.
//
Процедура УдалитьЗапрос(Идентификатор) Экспорт

	Запись = РегистрыСведений.ЗапросыЕГАИС.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Идентификатор;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры // УдалитьЗапрос()

// Записывает ответ из ЕГАИС на запрос.
//
// Параметры:
//  Идентификатор  - Строка - идентификатор запроса,
//  ДатаОтвета     - Дата - дата ответа из ЕГАИС,
//  Комментарий    - Строка - комментарий (причина отказа) из ЕГАИС.
//
Процедура ЗаписатьОтветИзЕГАИС(Идентификатор, ДатаОтвета, Комментарий) Экспорт
	
	Запись = РегистрыСведений.ЗапросыЕГАИС.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Идентификатор;
	Запись.Прочитать();
	
	Если НЕ Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Запись.ДатаОтвета = ДатаОтвета;
	Запись.Комментарий = Комментарий;
	
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
